# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
x = 3.1
y = True
z = 'word'
print(f'Переменная x имеет значение {x} и тип', type(x))
print(f'Переменная y имеет значение {y} и тип', type(y))
print(f'Переменная z имеет значение {z} и тип', type(z))
x = int(input('Введите целое число: '))
y = input('Введите False: ')
z = input('Введите строку: ')
print(f'Переменная x имеет значение {x} и тип', type(x))
print(f'Переменная y имеет значение {y} и тип', type(y))
print(f'Переменная z имеет значение {z} и тип', type(z))